{
	"works": [
		{
			"id": 1,
			"jobPosition": "Becario Manual Tester ",
			"startDate": "2020-10-01",
			"endDate": "2020-12-01",
			"company": "Digital Thinkers ",
			"description": "Como becario, tenía algunas tareas asignadas. Por las mañanas, debía verificar el estado del servidor, lo cual implicaba revisar el consumo de memoria, la memoria disponible y detectar posibles errores. Después de realizar esta verificación, procedía a realizar pruebas en la interfaz de usuario para asegurarme de que coincidiera con el diseño del sistema. También revisaba las funciones de la aplicación y proporcionaba retroalimentación sobre la experiencia del usuario."
		},
		{
			"id": 2,
			"jobPosition": "Desarrollador Web Jr.",
			"startDate": "2020-06-25",
			"endDate": "2021-06-25",
			"company": "NEO REDES ÓPTICAS DE OCCIDENTE ·",
			"description": "Como desarrollador web, trabajé en un pequeño equipo de tres personas. Me desempeñé en el frontend y el backend en los módulos que creé. Las tareas consistían en desarrollar módulos para una aplicación de la empresa. Esta aplicación gestionaba tickets para los técnicos, guardaba la ubicación actual del navegador en el que la sesión estaba abierta, permitía tomar fotos para el ticket y guardar mensajes. Durante todo este tiempo, trabajé en el frontend con Vue.js y el diseño con Vuetify. En cuanto al backend, utilicé Node.js, donde empleé MongoDB como base de datos y utilicé express, cors, morgan y otros."
		},
		{
			"id": 3,
			"jobPosition": "Ingeniero de Desarrollo Jr.",
			"startDate": "2021-06-21",
			"endDate": "2023-10-17",
			"company": "Nuxiba",
			"description": "Como ingeniero de software, mi labor consistió en llevar a cabo el desarrollo de diseños que fueron creados por un departamento, los cuales debían cumplir con especificaciones particulares. En este proceso, utilicé ReactJS para la parte del frontend, donde me enfoqué en la interfaz de usuario y la experiencia del usuario. Además, participé activamente en el backend, utilizando Python para implementar la lógica detrás de la aplicación. En cuanto a la implementación, me encargué del despliegue de la aplicación en el servidor Apache, asegurándome de que todo funcionara de manera eficiente y conforme a los requisitos establecidos. Esta combinación de habilidades me permitió contribuir tanto al aspecto visual y de experiencia del usuario como a la funcionalidad y el rendimiento del backend de la aplicación."
		},
		{
			"id": 3,
			"jobPosition": "Desarrollador Web",
			"startDate": "2023-10-23",
			"endDate": "2024-01-15",
			"company": "XoyTicket",
			"description": "Como desarrollador web, asumí un rol integral en el desarrollo de un proyecto que consistió en la implementación de una aplicación de gestión de tickets. El proyecto se construyó utilizando el framework Next.js 13 para el frontend y se desarrolló un sólido backend en Node.js. Para la gestión de datos, se implementó MySQL como base de datos. Mi participación fue esencial durante todo el proceso, desde la migración desde Angular hasta la implementación y mejora tanto en el backend como en el frontend. Este enfoque abarcador me permitió contribuir significativamente al éxito y la eficiencia del proyecto."
		}
	]
}
